In [1]:
import numpy as np
import pandas as pd

In [7]:
df=pd.DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'],index=['x','y','z'])

In [8]:
df

   a  b   c   d
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [9]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [10]:
# 행선택
# DataFrame_name[시작행_위치:끝행_위치]
df[0:2]

   a  b  c  d
x  0  1  2  3
y  4  5  6  7

In [11]:
# 인덱스 이름을 이용한 행선택방법
df.loc['x':'y']

   a  b  c  d
x  0  1  2  3
y  4  5  6  7

In [12]:
# 칼럼선택
# DataFrame_name[칼럼명]
df['b']

x    1
y    5
z    9
Name: b, dtype: int64

In [13]:
# DataFrame_name[칼럼명][행시작위치:행끝위치]
df['b'][0:2]

x    1
y    5
Name: b, dtype: int64

In [14]:
# DataFrame_name[칼럼명][행시작이름:행끝이름]
df['b']['x':'y']

x    1
y    5
Name: b, dtype: int64

In [15]:
# 칼럼을 'a'부터 'c' 인덱스를 'x'부터 'y'까지
# 이름을 기준 df.loc
# 위치를 기준 df.iloc

In [17]:
df.loc['x':'y','a':'c']

   a  b  c
x  0  1  2
y  4  5  6

In [19]:
df.iloc[0:2,0:3]

   a  b  c
x  0  1  2
y  4  5  6

In [22]:
df

   a  b   c   d
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [25]:
df.mean() #칼럼을 기준으로 평균 (디폴트 axis=0)

a    4.0
b    5.0
c    6.0
d    7.0
dtype: float64

In [24]:
df.mean(axis=1) #axis=1 인덱스 기준으로 평균

x    1.5
y    5.5
z    9.5
dtype: float64

In [26]:
df.sum()

a    12
b    15
c    18
d    21
dtype: int64

In [27]:
df.std()

a    4.0
b    4.0
c    4.0
d    4.0
dtype: float64

In [29]:
summary=df.describe() # 칼럼별 기술통계량

In [35]:
type(summary) # type이 판다스 데이터 프레임인 경우 판다스의 메서드 적용이 가능함

pandas.core.frame.DataFrame

In [33]:
summary.loc['max']

a     8.0
b     9.0
c    10.0
d    11.0
Name: max, dtype: float64

In [37]:
# 칼럼과 인덱스를 바꾸고 싶은 경우
df.T

   x  y   z
a  0  4   8
b  1  5   9
c  2  6  10
d  3  7  11

## 데이터 통합하기

### 1) 세로 방향으로 통합하기
- append

In [38]:
df1=pd.DataFrame({'Class1':[95,92,98,100],
             'Class2':[91,93,97,99]})

In [39]:
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [40]:
df2=pd.DataFrame({'Class1':[87,89],
             'Class2':[85,90]})

In [41]:
df2

   Class1  Class2
0      87      85
1      89      90

In [44]:
# 기존데이터명.append(붙일 데이터)
df1.append(df2,ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [45]:
df3=pd.DataFrame({'Class1':[100,95]})

In [46]:
df1.append(df3,ignore_index=True) # 칼럼수가 안 맞는 경우 결측치 처리됨

   Class1  Class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    99.0
4     100     NaN
5      95     NaN

### 2) 가로로 통합하기
- join

In [50]:
df4=pd.DataFrame({'Class4':[93,91,95,98]})

In [52]:
df1.join(df4)

   Class1  Class2  Class4
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

### 3) 특정 열을 기준으로 통합하기

In [53]:
# DataFrame1_name.merge(DataFrame2_name)

In [54]:
df_left=pd.DataFrame({'key':['A','B','C'],'left':[1,2,3]})

In [55]:
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [56]:
df_right=pd.DataFrame({'key':['A','B','D'],'right':[4,5,6]})

In [57]:
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [58]:
# left: 왼쪽 데이터 기준
# right: 오른쪽 데이터 기준
# outer: 다 가져다가 붙임
# inner: 둘다 있는 것만 붙임

In [59]:
df_left.merge(df_right,on='key',how='left')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [60]:
df_left.merge(df_right,on='key',how='right')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [61]:
df_left.merge(df_right,on='key',how='outer')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [62]:
df_left.merge(df_right,on='key',how='inner')

  key  left  right
0   A     1      4
1   B     2      5